In [1]:
import pandas as pd

In [15]:
#cadastro da loja a:
cadastro_a = { 'Id': ['AA2930', 'BB4563', 'CC2139', 'DE2521', 'GT3462', 'HH1158'],
              'Nome' : ['Victor', 'Amanda', 'Bruna', 'Carlos', 'Ricardo', 'Maria'],
              'Idade' : [20,35,40,54,30,27],
              'CEP' : ['00092-029', '11111-111', '22222-888', '00000-999', '88888-111', '77777-666']
}
cadastro_a = pd.DataFrame(cadastro_a, columns = ['Id', 'Nome', 'Idade', 'CEP'])

In [16]:
#cadastro da loja b:
cadastro_b = { 'Id' : ['CC9999', 'EF4488', 'DD9999', 'GT3462', 'HH1158'],
              'Nome' : ['Marcos', 'Patricia', 'Ericka', 'Ricardo', 'Maria'],
              'Idade' : [19,30,22,30,27],
              'CEP' : ['00092-029', '11111-111', '11111-888', '88888-111', '77777-666']    
}
cadastro_b = pd.DataFrame(cadastro_b, columns = ['Id', 'Nome', 'Idade', 'CEP'])

In [17]:
#registro de compras de todas as unidades 

compras = {'Id': ['AA2930', 'EF4488', 'CC2139', 'EF4488', 'CC9999', 'AA2930', 'HH1158', 'HH1158'],
           'Data': ['2019-01-01', '2019-01-30', '2019-01-30', '2019-02-01', '2019-02-20', '2019-03-15', '2019-04-01', '2019-04-10'],
           'Valor' : [200,100,40,150,300,25,50,500]
}

compras = pd.DataFrame(compras, columns= ['Id', 'Data', 'Valor'])

In [18]:
# pd.merge(tabela_da_esquerda, tabela_da_direita, on = 'coluna_coincidente', how = 'left|right|inner|outer')

In [19]:
pd.merge(cadastro_a,cadastro_b, on = ['Id'], how = 'inner')

       Id   Nome_x  Idade_x      CEP_x   Nome_y  Idade_y      CEP_y
0  GT3462  Ricardo       30  88888-111  Ricardo       30  88888-111
1  HH1158    Maria       27  77777-666    Maria       27  77777-666

In [20]:
pd.merge(cadastro_a, cadastro_b[['Id', 'Idade', 'CEP']], on = ['Id'], how = 'inner', suffixes = ('_A','_B'))

       Id     Nome  Idade_A      CEP_A  Idade_B      CEP_B
0  GT3462  Ricardo       30  88888-111       30  88888-111
1  HH1158    Maria       27  77777-666       27  77777-666

In [21]:
#Join Full

In [27]:
lojas = pd.concat([cadastro_a,cadastro_b], ignore_index = True)

In [28]:
lojas.drop_duplicates(['Id')

       Id      Nome  Idade        CEP
0  AA2930    Victor     20  00092-029
1  BB4563    Amanda     35  11111-111
2  CC2139     Bruna     40  22222-888
3  DE2521    Carlos     54  00000-999
4  GT3462   Ricardo     30  88888-111
5  HH1158     Maria     27  77777-666
6  CC9999    Marcos     19  00092-029
7  EF4488  Patricia     30  11111-111
8  DD9999    Ericka     22  11111-888